#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_test.module.onestopauth.module.client_ztest-134.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=de0126cd-2f85-42bd-87a5-6d79ae7187a6]
module.keycloak_test.module.onestopauth.module.client_ztest-134.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=2314ee5d-3da4-4d07-a81d-4a63aa7d1d3c]
module.keycloak_test.module.onestopauth.module.client_ztest-134.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=edae1d60-464e-482c-b147-f162e25affe5]
module.keycloak_test.module.onestopauth.module.client_ztest-134.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=46eaa930-0d81-46fa-8120-0bf698e2c505]
module.keycloak_test.module.onestopauth.module.client_ztest-134.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=36c8869c-49ab-45a0-909c-36a529a1c15b]
module.keycloak_test.module.onestopauth.module.client_ztest-134.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=83a5d203-90a3-4d4d-ae5a-9e85e443d503]
module.keycloak_test.module.onestopauth.module.client_ztest-134.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=5b53b89c-75bc-4bad-9943-80af1bcbbffd]
module.keycloak_test.module.onestopauth.module.client_ztest-134.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=435e44ea-23f0-4163-8c46-de63fa213dbe]
module.keycloak_test.module.onestopauth.module.client_test-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=6ccded86-7bfe-496a-8668-3e205038792b]
module.keycloak_test.module.onestopauth.module.client_test-1.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=2f73a375-13b3-442f-84b6-51674326fa9e]
module.keycloak_test.module.onestopauth.module.client_test-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=b36688bb-e879-42ba-9bea-d10c387b0966]
module.keycloak_test.module.onestopauth.module.client_test-1.keycloak_generic_client_protocol_mapper.display_name_mapper: Refreshing state... [id=335b4b3c-5013-4e28-9843-aeb9083b0198]
module.keycloak_test.module.onestopauth.module.client_test-1.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=f4a61af6-c315-44b7-a8ae-4b5bd88e1d90]
module.keycloak_test.module.onestopauth.module.client_test-1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=e6fcd507-739b-4b1f-97b9-3dc78d620f55]
module.keycloak_test.module.onestopauth.module.client_test-1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f3ccb01c-e267-4e01-ae3e-1e4c5f78afce]
module.keycloak_test.module.onestopauth.module.client_test-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=889d33a9-a000-48ad-ad9c-a797f18d254a]
module.keycloak_test.module.onestopauth.module.client_test-1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=d4a753c5-5b5f-4820-a955-5a1f27219421]
module.keycloak_test.module.onestopauth.module.client_test-08-4-2021-166.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=7818ebd6-d3a2-47fc-ba22-eebaef13d53d]
module.keycloak_test.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=c8c706ac-ae80-4199-b02a-4bd38fe9d1c0]
module.keycloak_test.module.onestopauth.module.client_junmin-client-test-111.keycloak_generic_client_protocol_mapper.display_name_mapper: Refreshing state... [id=6d770dec-57d1-483b-ad8a-e22f0e2a0c92]
module.keycloak_test.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=015d910d-8712-4e74-a514-d7ca404bf9bf]
module.keycloak_test.module.onestopauth.module.client_junmin-client-test-111.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=0c3a4413-c97d-4a3f-895e-63dd3c86b065]
module.keycloak_test.module.onestopauth.module.client_test-08-4-2021-166.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=881d2c88-159d-4e9b-9f15-2ee4af8cdede]
module.keycloak_test.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.display_name_mapper: Refreshing state... [id=650879f6-f9cc-4240-84c8-2368607208a9]
module.keycloak_test.module.onestopauth.module.client_test-08-4-2021-166.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=6550a0d4-513d-4acc-84c4-72bc6d43761e]
module.keycloak_test.module.onestopauth.module.client_junmin-client-test-111.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=e84518a0-36e5-46ac-b1a1-25508abcbbd9]
module.keycloak_test.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=c6007b35-ae8d-445b-aa6d-10d34639038c]
module.keycloak_test.module.onestopauth.module.client_test-08-4-2021-166.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=60619eee-0cb7-4fd6-96f6-285c27db63b8]
module.keycloak_test.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=2a1d1057-0f36-4bf1-91cc-026bc6b46d78]
module.keycloak_test.module.onestopauth.module.client_junmin-client-test-111.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=27dcb91d-4f69-4c86-95ba-b4542d1510be]
module.keycloak_test.module.onestopauth.module.client_test-08-4-2021-166.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=2b84acea-d39a-4bd2-95a6-e29223488443]
module.keycloak_test.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=6da6ca5d-9c38-444f-b7f5-dcb5752406ef]
module.keycloak_test.module.onestopauth.module.client_junmin-client-test-111.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8750358b-bebe-4ee7-a555-dcd39cfcb419]
module.keycloak_test.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=ffdf0b0f-f615-4f6d-8147-209ef9494da8]
module.keycloak_test.module.onestopauth.module.client_test-08-4-2021-166.keycloak_generic_client_protocol_mapper.display_name_mapper: Refreshing state... [id=8de028a5-5694-400b-bdab-9bf9ee5ce5fb]
module.keycloak_test.module.onestopauth.module.client_junmin-client-test-111.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=037f9f6c-7879-4142-ae7c-c56c2a652acd]
module.keycloak_test.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=55e7e3fb-a755-4175-8962-a43c469d0ea9]
module.keycloak_test.module.onestopauth.module.client_test-08-4-2021-166.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=d4a31472-17d1-4260-adc4-6bc25b5604b0]
module.keycloak_test.module.onestopauth.module.client_junmin-client-test-111.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=0ad1e887-62a1-4375-a1db-a48ef7b477f7]
module.keycloak_test.module.onestopauth.module.client_test-08-4-2021-166.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=d3590762-b3e9-42da-b452-4804bd75894a]
module.keycloak_test.module.onestopauth.module.client_test-08-4-2021-166.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=260ad8d8-5f07-4c32-9b85-040234b481e7]
module.keycloak_test.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f0d357e1-7b8b-4f63-b18b-7b3cbedc9d34]
module.keycloak_test.module.onestopauth.module.client_junmin-client-test-111.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=eef1b3ee-ea4d-465e-b1e3-eeef0d54fc2d]
module.keycloak_test.module.onestopauth.module.client_junmin-client-test-111.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=bf31a5ca-4fef-4c68-93c9-c32e401319c7]
module.keycloak_test.module.onestopauth_business.module.client_march-2-b-ce-id-all-prod-6044.keycloak_generic_client_protocol_mapper.display_name_mapper: Refreshing state... [id=4c2784c7-52d6-46a8-b227-e4bf36c8328a]
module.keycloak_test.module.onestopauth_business.module.client_march-2-b-ce-id-all-prod-6044.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=8f0f23b7-4bcc-4453-abf9-945a8d4b3892]
module.keycloak_test.module.onestopauth_business.module.client_march-2-b-ce-id-all-prod-6044.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=7a6bf366-9217-4f02-a763-3e1c690efc87]
module.keycloak_test.module.onestopauth_business.module.client_march-2-b-ce-id-all-prod-6044.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=43f4e27e-c2eb-49fd-8d4a-8920492f0d49]
module.keycloak_test.module.onestopauth_business.module.client_march-2-b-ce-id-all-prod-6044.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=992f6c45-2b5e-4182-b934-d57e4e6cdafa]
module.keycloak_test.module.onestopauth_business.module.client_march-2-b-ce-id-all-prod-6044.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b0b15646-a6e6-4347-bbf3-fb28bd3be25d]
module.keycloak_test.module.onestopauth_business.module.client_march-2-b-ce-id-all-prod-6044.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=b2b1fe86-5adc-4ee1-94b8-457370cf5097]
module.keycloak_test.module.onestopauth_business.module.client_march-2-b-ce-id-all-prod-6044.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=d9dbed4d-96f3-44a0-8464-49b49a9b4431]
module.keycloak_test.module.onestopauth_business.module.client_march-2-b-ce-id-all-prod-6044.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=b986e130-d5c1-458a-a062-ba7153ffc1c3]
module.keycloak_test.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b35b50bc-4e9f-489e-a07f-094fc3b5f6fb]
module.keycloak_test.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=0dfdd338-3d7a-493f-972e-aa90f9dca813]
module.keycloak_test.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=efe0636e-fec0-45c1-a010-dca3bd92fbdd]
module.keycloak_test.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=a395df78-e767-40f7-a975-4f13b5948c0d]
module.keycloak_test.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=18a7cd72-1170-44da-ad0e-f1126445a015]
module.keycloak_test.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.display_name_mapper: Refreshing state... [id=e588bd29-32f4-4c22-af4b-f1641feb5e74]
module.keycloak_test.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=84d46c9b-8dc6-494a-ba45-3ebdeeea8a5b]
module.keycloak_test.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=017f22ec-5c7d-4dfa-84ac-2fddcfb3427a]
module.keycloak_test.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=111edcb2-a105-4e03-ad38-fe7d1052dec0]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=afe980db-1143-4496-95e6-6af762624016]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.display_name_mapper: Refreshing state... [id=478093b5-1d85-44ee-9290-1dde831f4bb2]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7735369f-97b6-40d1-b9d7-d11e2d5e8264]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=2a9d4f7d-00f2-4a2f-8cb4-d5cc120a8a1b]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8c6e98fe-75a4-42a7-bf1b-c3d7e579dd0b]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=44c24238-10b4-4d9a-b971-bfbaf3a57f49]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f345e9f1-be87-4b71-ae6f-d9e55be698f9]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ab096687-352c-4eb7-8ff1-c49daccf7988]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2ad14a42-adf0-4eb6-b87f-04478a1b85ba]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=771cf276-c9b5-42d8-ad89-11674cbabf0e]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8e38de05-06d5-436a-9de0-b320970d2c38]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=af79bb43-7e01-4a26-9813-bd8eccce45ec]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8fbaa254-7423-4ae2-8755-661e88b7030c]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=1766753c-5bec-4425-b67b-99096816e02e]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=919a2516-5484-44bf-ba5d-298b70c76a83]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.display_name_mapper: Refreshing state... [id=cb43e349-c7a3-4787-a9ed-4a493edd0a10]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=c29c273e-4919-4ee1-a9c7-e94028642638]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=c12bf377-f60c-4b79-b1ef-5828f1ab66f9]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth_business.module.client_kuro-mar-07-b-ce-id-business-test-6371.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "kuro-mar-07-b-ce-id-business-test-6371"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_dev.module.onestopauth_business.module.client_kuro-mar-07-b-ce-id-business-test-6371.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_dev.module.onestopauth_business.module.client_kuro-mar-07-b-ce-id-business-test-6371.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_dev.module.onestopauth_business.module.client_kuro-mar-07-b-ce-id-business-test-6371.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_dev.module.onestopauth_business.module.client_kuro-mar-07-b-ce-id-business-test-6371.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "kuro-mar-07-b-ce-id-business-test-6371"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_dev.module.onestopauth_business.module.client_kuro-mar-07-b-ce-id-business-test-6371.keycloak_generic_client_protocol_mapper.display_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "display_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "display_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "displayName"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "display_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_dev.module.onestopauth_business.module.client_kuro-mar-07-b-ce-id-business-test-6371.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_dev.module.onestopauth_business.module.client_kuro-mar-07-b-ce-id-business-test-6371.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_dev.module.onestopauth_business.module.client_kuro-mar-07-b-ce-id-business-test-6371.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_dev.module.onestopauth_business.module.client_kuro-mar-07-b-ce-id-business-test-6371.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "kuro-mar-07-b-ce-id-business-test-6371"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "kuro-mar-07-b-ce-id-business-test-6371"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth-business"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://bceidDev.com",
        ]
      + web_origins                              = [
          + "+",
          + "http://bceidDev.com",
        ]
    }

  # module.keycloak_test.module.onestopauth_business.module.client_kuro-mar-07-b-ce-id-business-test-6371.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "kuro-mar-07-b-ce-id-business-test-6371"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_test.module.onestopauth_business.module.client_kuro-mar-07-b-ce-id-business-test-6371.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_test.module.onestopauth_business.module.client_kuro-mar-07-b-ce-id-business-test-6371.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_test.module.onestopauth_business.module.client_kuro-mar-07-b-ce-id-business-test-6371.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_test.module.onestopauth_business.module.client_kuro-mar-07-b-ce-id-business-test-6371.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "kuro-mar-07-b-ce-id-business-test-6371"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_test.module.onestopauth_business.module.client_kuro-mar-07-b-ce-id-business-test-6371.keycloak_generic_client_protocol_mapper.display_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "display_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "display_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "displayName"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "display_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_test.module.onestopauth_business.module.client_kuro-mar-07-b-ce-id-business-test-6371.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_test.module.onestopauth_business.module.client_kuro-mar-07-b-ce-id-business-test-6371.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_test.module.onestopauth_business.module.client_kuro-mar-07-b-ce-id-business-test-6371.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-business"
    }

  # module.keycloak_test.module.onestopauth_business.module.client_kuro-mar-07-b-ce-id-business-test-6371.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "kuro-mar-07-b-ce-id-business-test-6371"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "kuro-mar-07-b-ce-id-business-test-6371"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth-business"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://bceidTest.com",
        ]
      + web_origins                              = [
          + "+",
          + "http://bceidTest.com",
        ]
    }

Plan: 20 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 4250 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*